#Область Задача1

&НаКлиенте
Процедура ЗаполнитьВидКонтрагентов(Команда)
	ЗаполнитьВидКонтрагентовНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВидКонтрагентовНаСервере()
	
	//1. Для всех контрагентов из справочника «Контрагенты» заполнить реквизит «ВидКонтрагента» значением «Юридическое лицо»
	
	ВыборкаКонтрагентоа = Справочники.Контрагенты.Выбрать();
	
	Пока ВыборкаКонтрагентоа.Следующий() Цикл
		
		СправочникСсылка = ВыборкаКонтрагентоа.Ссылка;
		КонтрагентОбъект = СправочникСсылка.ПолучитьОбъект();
		КонтрагентОбъект.ВидКонтрагента = Перечисления.ЮрФизИп.ЮридическоеЛицо;
		КонтрагентОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура ИзменитьЮридическийАдрес(Команда)
	ИзменитьЮридическийАдресНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЮридическийАдресНаСервере()
	
	//2. Для контрагента «Радуга плюс» (ИНН 123456789) нужно изменить юридический адрес, 
	//установив нового значение: «124034, Москва, ул. Никольская, 132, оф. 405»
	СсылкаНаСправочникКонтрагенты = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "123456789");
	
	Если НЕ СсылкаНаСправочникКонтрагенты.Пустая() Тогда
		
		СправочникКонтрагентыОбъект = СсылкаНаСправочникКонтрагенты.ПолучитьОбъект();
		ТабЧастьКонтактнаяИнформация = СправочникКонтрагентыОбъект.КонтактнаяИнформация;
		
		Для каждого Строка из ТабЧастьКонтактнаяИнформация Цикл
			
			Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента Тогда
				
				Строка.Значение = "124034, Москва, ул. Никольская, 132, оф. 405";
				
			КонецЕсли;
			
		КонецЦикла;
		
		СправочникКонтрагентыОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура ПолучениеСпискаКонстант(Команда)
	ПолучениеСпискаКонстантНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаКонстантНаСервере()
	
	//3. Нужно получить и показать пользователю в виде сообщений список всех констант,
	//которые определены в текущей конфигурации (подсказка: используйте свойство глобального контекста Метаданные).
	//В результате пользователь должен увидеть примерно такой результат:
	//"В текущей конфигурации используются следующие константы:
	//- Константа "ЗаголовокПрограммы"
	//- Константа "ДатаЗапретаРедактирования"
	//…
	СписокКонстант = Метаданные.Константы;
	
	Если СписокКонстант.Количество() = 0 Тогда
		
		Сообщить("В текущей конфигурации нет констант");
		
	Иначе
		
		Сообщить("В текущей конфигурации используются следующие константы (" + СписокКонстант.Количество() + " шт):");
		
		Для каждого Константа из СписокКонстант Цикл
			Сообщить(Константа);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура ПоискВалютПоСпособуУстановкиКурса(Команда)
	ПоискВалютПоСпособуУстановкиКурсаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискВалютПоСпособуУстановкиКурсаНаСервере()
	//4. В справочнике "Валюты" найти все валюты, для которых установлен 
	//способ установки курса "Загружается из интернета" 
	//и показать их пользователю в виде сообщений.
	Выборка = Справочники.Валюты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурса.ЗагружаетсяИзИнтернета Тогда
			Сообщить(Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаСервере
Процедура КоличествоЭлементовВСправочникеНоменклатураНаСервере()
	// 5. В справочнике номенклатура подсчитать количество элементов (группы не считать) и вывести пользователю
	Счетчик = 0;
	Выборка = Справочники.Номенклатура.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа = Ложь Тогда
			
			Счетчик = Счетчик + 1;
			Сообщить("Товар №" + Счетчик + ": " + Выборка.Наименование);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Количество товаров в справочнике номенклатура: " + Счетчик + " шт");
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭлементовВСправочникеНоменклатура(Команда)
	КоличествоЭлементовВСправочникеНоменклатураНаСервере();
КонецПроцедуры

#КонецОбласти
