#Область Задача1

&НаКлиенте
Процедура ЗаполнитьВидКонтрагентов(Команда)
	ЗаполнитьВидКонтрагентовНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВидКонтрагентовНаСервере()
	
	//1. Для всех контрагентов из справочника «Контрагенты» заполнить реквизит «ВидКонтрагента» значением «Юридическое лицо»
	
	ВыборкаКонтрагентоа = Справочники.Контрагенты.Выбрать();
	
	Пока ВыборкаКонтрагентоа.Следующий() Цикл
		
		СправочникСсылка = ВыборкаКонтрагентоа.Ссылка;
		КонтрагентОбъект = СправочникСсылка.ПолучитьОбъект();
		КонтрагентОбъект.ВидКонтрагента = Перечисления.ЮрФизИп.ЮридическоеЛицо;
		КонтрагентОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура ИзменитьЮридическийАдрес(Команда)
	ИзменитьЮридическийАдресНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЮридическийАдресНаСервере()
	
	//2. Для контрагента «Радуга плюс» (ИНН 123456789) нужно изменить юридический адрес, 
	//установив нового значение: «124034, Москва, ул. Никольская, 132, оф. 405»
	СсылкаНаСправочникКонтрагенты = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "123456789");
	
	Если НЕ СсылкаНаСправочникКонтрагенты.Пустая() Тогда
		
		СправочникКонтрагентыОбъект = СсылкаНаСправочникКонтрагенты.ПолучитьОбъект();
		ТабЧастьКонтактнаяИнформация = СправочникКонтрагентыОбъект.КонтактнаяИнформация;
		
		Для каждого Строка из ТабЧастьКонтактнаяИнформация Цикл
			
			Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента Тогда
				
				Строка.Значение = "124034, Москва, ул. Никольская, 132, оф. 405";
				
			КонецЕсли;
			
		КонецЦикла;
		
		СправочникКонтрагентыОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
