&НаСервере
Процедура РаботаСМакетомНаСервере()
	// В текстовом файле содержится информация о рабочих, 
	// праздничных и выходных днях текущего года.
	// Нужно реализовать заполнение регистра сведений 
	// «Производственный календарь» на основании этого файла.
	
	МакетДанныеКалендаря = Метаданные.РегистрыСведений.ПроизводственныйКалендарь.Макеты.ДанныеКалендаря;
	ТекстовыйДокумент	 = РегистрыСведений.ПроизводственныйКалендарь.ПолучитьМакет(МакетДанныеКалендаря);
	
	
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	НаборЗаписей 	= РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей();
	
	Для Счетчик = 1 По КоличествоСтрок Цикл
		
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
		
		ПозицияЗапятой = СтрНайти(Строка, ",");
		
		ДеньНеделиСтрокой = Лев(Строка, ПозицияЗапятой -1);
		ДатаСтрокой = Сред(Строка, ПозицияЗапятой +1);
		
		ДеньНедели = Перечисления.ВидыДнейКалендаря.Праздник;
		
		Если ДатаСтрокой <> "" И ДеньНеделиСтрокой <> "" Тогда
			Дата = Дата(ДатаСтрокой);
			
			Если ДеньНеделиСтрокой = "Рабочий" Тогда
				ВидДня = Перечисления.ВидыДнейКалендаря.Рабочий;
			ИначеЕсли ДеньНеделиСтрокой = "Суббота" Тогда
				ВидДня = Перечисления.ВидыДнейКалендаря.Суббота;
			ИначеЕсли ДеньНеделиСтрокой = "Воскресенье" Тогда
				ВидДня = Перечисления.ВидыДнейКалендаря.Воскресенье;
			ИначеЕсли ДеньНеделиСтрокой = "Праздник" Тогда
				ВидДня = Перечисления.ВидыДнейКалендаря.Праздник;
			ИначеЕсли ДеньНеделиСтрокой = "Предпраздничный" Тогда
				ВидДня = Перечисления.ВидыДнейКалендаря.Предпраздничный;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Дата = Дата;
			НоваяЗапись.ВидДня = ВидДня;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСМакетом(Команда)
	РаботаСМакетомНаСервере();
КонецПроцедуры