Процедура ПередЗаписью(Отказ)
	
	//	ЗАДАЧА: Контроль вида договора
	
	СсылкаНаВладельца = Справочники.Контрагенты.НайтиПоНаименованию(Владелец);
	
	//Получаем тип владельца
	ВладелецПокупатель		= СсылкаНаВладельца.Покупатель;
	ВладелецПоставщик		= СсылкаНаВладельца.Поставщик;
	ВладелецПеревозчик		= СсылкаНаВладельца.Перевозчик;
	ВладелецПрочиеОтношения = СсылкаНаВладельца.ПрочиеОтношения;
	
	ПоставщикИлиПеревозчик = (ВладелецПоставщик ИЛИ ВладелецПеревозчик);
	
	//Если тип отношений в договоре указан, а у владельца не отмечен этот тип, то не записываем договор
	Если ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем И ВладелецПокупатель = Ложь Тогда
		
		Отказ = Истина;
		Сообщить("У владельца: " + СсылкаНаВладельца.Наименование + " договора: " + Наименование +
		" не указан тип отношений: Покупатель");
		
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком И ПоставщикИлиПеревозчик = Ложь Тогда
		Отказ = Истина;
		Сообщить("У владельца: " + СсылкаНаВладельца.Наименование + " договора: " + Наименование +
		" не указан тип отношений: Поставщик или Перевозчик");
		
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоров.Прочее И ВладелецПрочиеОтношения = Ложь Тогда
		Отказ = Истина;
		Сообщить("У владельца: " + СсылкаНаВладельца.Наименование + " договора: " + Наименование +
		" не указан тип отношений: Прочие отношения");
	КонецЕсли;
	
КонецПроцедуры
