&НаКлиенте
Процедура ЗаполнитьВсеНаименования(Команда)
	ЗаполнитьВсеНаименованияНаСервере();
	
	ИзмененныйТип = ПолучитьСсылку();
	
	ОповеститьОбИзменении(ИзмененныйТип);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылку();
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВсеНаименованияНаСервере()
	
	ВыборкаСправочников = Справочники.ДоговорыКонтрагентов.Выбрать();
	Пока ВыборкаСправочников.Следующий() Цикл
		
		НомерДоговора = ВыборкаСправочников.Номер;
		ДатаДоговора = ВыборкаСправочников.ДатаДоговора;
		
		СсылкаНаДоговор = ВыборкаСправочников.Ссылка;
		ОбъектДоговор = СсылкаНаДоговор.ПолучитьОбъект();
		
		//Ниже вызывается общий модуль, вот его текст:
		//
		//Функция ЗаполнитьНаименования(Номер, Дата) Экспорт
		//	
		//	Возврат "Договор № "
		//	+ Номер + " от " + Формат(Дата,"ДФ=dd.MM.yyyy");
		//	
		//КонецФункции
		//
		
		ОбъектДоговор.Наименование = ЗаполнитьНаименованиеДоговоровКонтрагентовНаСервере.ЗаполнитьНаименования(НомерДоговора, ДатаДоговора);
		ОбъектДоговор.Записать();
	КонецЦикла;
КонецПроцедуры