&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Сообщить("Выбрана строка: " + Элемент.ТекущаяСтрока);
	
	email = "";
	ЮридическийАдрес = "";
	ФактическийАдрес = "";
	Телефон = "";
	
	НаименованиеКонтрагента = Элемент.ТекущиеДанные.Наименование;
	ПолучитьДанные(НаименованиеКонтрагента);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанные(Наименование)
	
	СсылкаНаСправочник = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
	ТабличнаяЧастьСправочника = СсылкаНаСправочник.КонтактнаяИнформация;
	
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧастьСправочника Цикл
		Сообщить(СтрокаТабличнойЧасти.Значение);
		
		Если СтрокаТабличнойЧасти.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Телефон = СтрокаТабличнойЧасти.Значение;
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			
			Если СтрокаТабличнойЧасти.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента Тогда
			
				ЮридическийАдрес = СтрокаТабличнойЧасти.Значение;
			
			ИначеЕсли СтрокаТабличнойЧасти.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента Тогда
			
				ФактическийАдрес = СтрокаТабличнойЧасти.Значение;
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.Тип = Перечисления.ТипыКонтактнойИнформации.ЭлПочта Тогда
			email = СтрокаТабличнойЧасти.Значение
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры