&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Проверяем что нужно проверять дубли контрагентов
	Если Константы.КонтролироватьДублиКонтрагентов.Получить() Тогда
		
		//Если записывается новый контрагент
		Если ТекущийОбъект.ЭтоНовый() Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", ТекущийОбъект.Наименование);
			Выборка = Справочники.Контрагенты.Выбрать(,,Отбор);
			
			Пока Выборка.Следующий() Цикл
				
				Сообщить("Внимание! В справочнике уже есть контрагент с таким наименованием: код " + Выборка.Код);
				Отказ = Истина;
				
			КонецЦикла;
			
		//Если записывается уже существующий контрагент
		ИначеЕсли ТекущийОбъект.ЭтоНовый() = Ложь Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", ТекущийОбъект.Наименование);
			Выборка = Справочники.Контрагенты.Выбрать(,,Отбор);
			
			Пока Выборка.Следующий() Цикл
				
				Если ТекущийОбъект.Код <> Выборка.Код Тогда
					
					Сообщить("Внимание! В справочнике уже есть контрагент с таким наименованием: код " + Выборка.Код);
					Отказ = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры